In [1]:
import seaborn as sns
import pandas as pd
df=sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
df2 = df.dropna()

In [3]:
df.loc[df.embark_town.str.contains("Southampton|Cherbourg")]

ValueError: Cannot mask with non-boolean array containing NA / NaN values

In [5]:
df2.loc[df2.embark_town.str.contains("Southampton|Cherbourg")]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
872,0,1,male,33.0,0,0,5.0000,S,First,man,True,B,Southampton,no,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [2]:
df.loc[df.embark_town.str.contains("Southampton|Cherbourg",na=False)]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [9]:
df.loc[df.embark_town.isin(["Southampton","Cherbourg"])]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [2]:
list(zip(df["sex"],df["age"],df["class"]))

[('male', 22.0, 'Third'),
 ('female', 38.0, 'First'),
 ('female', 26.0, 'Third'),
 ('female', 35.0, 'First'),
 ('male', 35.0, 'Third'),
 ('male', nan, 'Third'),
 ('male', 54.0, 'First'),
 ('male', 2.0, 'Third'),
 ('female', 27.0, 'Third'),
 ('female', 14.0, 'Second'),
 ('female', 4.0, 'Third'),
 ('female', 58.0, 'First'),
 ('male', 20.0, 'Third'),
 ('male', 39.0, 'Third'),
 ('female', 14.0, 'Third'),
 ('female', 55.0, 'Second'),
 ('male', 2.0, 'Third'),
 ('male', nan, 'Second'),
 ('female', 31.0, 'Third'),
 ('female', nan, 'Third'),
 ('male', 35.0, 'Second'),
 ('male', 34.0, 'Second'),
 ('female', 15.0, 'Third'),
 ('male', 28.0, 'First'),
 ('female', 8.0, 'Third'),
 ('female', 38.0, 'Third'),
 ('male', nan, 'Third'),
 ('male', 19.0, 'First'),
 ('female', nan, 'Third'),
 ('male', nan, 'Third'),
 ('male', 40.0, 'First'),
 ('female', nan, 'First'),
 ('female', nan, 'Third'),
 ('male', 66.0, 'Second'),
 ('male', 28.0, 'First'),
 ('male', 42.0, 'First'),
 ('male', nan, 'Third'),
 ('male', 21.0, 'Third'),
 ('female', 18.0, 'Third'),
 ('female', 14.0, 'Third'),
 ('female', 40.0, 'Third'),
 ('female', 27.0, 'Second'),
 ('male', nan, 'Third'),
 ('female', 3.0, 'Second'),
 ('female', 19.0, 'Third'),
 ('male', nan, 'Third'),
 ('male', nan, 'Third'),
 ('female', nan, 'Third'),
 ('male', nan, 'Third'),
 ('female', 18.0, 'Third'),
 ('male', 7.0, 'Third'),
 ('male', 21.0, 'Third'),
 ('female', 49.0, 'First'),
 ('female', 29.0, 'Second'),
 ('male', 65.0, 'First'),
 ('male', nan, 'First'),
 ('female', 21.0, 'Second'),
 ('male', 28.5, 'Third'),
 ('female', 5.0, 'Second'),
 ('male', 11.0, 'Third'),
 ('male', 22.0, 'Third'),
 ('female', 38.0, 'First'),
 ('male', 45.0, 'First'),
 ('male', 4.0, 'Third'),
 ('male', nan, 'First'),
 ('male', nan, 'Third'),
 ('female', 29.0, 'Second'),
 ('male', 19.0, 'Third'),
 ('female', 17.0, 'Third'),
 ('male', 26.0, 'Third'),
 ('male', 32.0, 'Second'),
 ('female', 16.0, 'Third'),
 ('male', 21.0, 'Second'),
 ('male', 26.0, 'Third'),
 ('male', 32.0, 'Third'),
 ('male', 25.0, 'Third'),
 ('male', nan, 'Third'),
 ('male', nan, 'Third'),
 ('male', 0.83, 'Second'),
 ('female', 30.0, 'Third'),
 ('male', 22.0, 'Third'),
 ('male', 29.0, 'Third'),
 ('female', nan, 'Third'),
 ('male', 28.0, 'First'),
 ('female', 17.0, 'Second'),
 ('female', 33.0, 'Third'),
 ('male', 16.0, 'Third'),
 ('male', nan, 'Third'),
 ('female', 23.0, 'First'),
 ('male', 24.0, 'Third'),
 ('male', 29.0, 'Third'),
 ('male', 20.0, 'Third'),
 ('male', 46.0, 'First'),
 ('male', 26.0, 'Third'),
 ('male', 59.0, 'Third'),
 ('male', nan, 'Third'),
 ('male', 71.0, 'First'),
 ('male', 23.0, 'First'),
 ('female', 34.0, 'Second'),
 ('male', 34.0, 'Second'),
 ('female', 28.0, 'Third'),
 ('male', nan, 'Third'),
 ('male', 21.0, 'First'),
 ('male', 33.0, 'Third'),
 ('male', 37.0, 'Third'),
 ('male', 28.0, 'Third'),
 ('female', 21.0, 'Third'),
 ('male', nan, 'Third'),
 ('male', 38.0, 'Third'),
 ('female', nan, 'Third'),
 ('male', 47.0, 'First'),
 ('female', 14.5, 'Third'),
 ('male', 22.0, 'Third'),
 ('female', 20.0, 'Third'),
 ('female', 17.0, 'Third'),
 ('male', 21.0, 'Third'),
 ('male', 70.5, 'Third'),
 ('male', 29.0, 'Second'),
 ('male', 24.0, 'First'),
 ('female', 2.0, 'Third'),
 ('male', 21.0, 'Second'),
 ('male', nan, 'Third'),
 ('male', 32.5, 'Second'),
 ('female', 32.5, 'Second'),
 ('male', 54.0, 'First'),
 ('male', 12.0, 'Third'),
 ('male', nan, 'Third'),
 ('male', 24.0, 'Third'),
 ('female', nan, 'Third'),
 ('male', 45.0, 'Third'),
 ('male', 33.0, 'Third'),
 ('male', 20.0, 'Third'),
 ('female', 47.0, 'Third'),
 ('female', 29.0, 'Second'),
 ('male', 25.0, 'Second'),
 ('male', 23.0, 'Second'),
 ('female', 19.0, 'First'),
 ('male', 37.0, 'First'),
 ('male', 16.0, 'Third'),
 ('male', 24.0, 'First'),
 ('female', nan, 'Third'),
 ('female', 22.0, 'Third'),
 ('female', 24.0, 'Third'),
 ('male', 19.0, 'Third'),
 ('male', 18.0, 'Second'),
 ('male', 19.0, 'Second'),
 ('male', 27.0, 'Third'),
 ('female', 9.0, 'Third'),
 ('male', 36.5, 'Second'),
 ('male', 42.0, 'Second'),
 ('male', 51.0, 'Second'),
 ('female', 22.0, 'First'),
 ('male', 55.5, 'Third'),
 ('male', 40.5, 'Third'),
 ('male', nan, 'Third'),
 ('male', 51.0, 'First'),
 ('female', 16.0, 'Third'),
 ('male', 30.0, 'Third'),
 ('male', nan, 'Third'),
 ('male', nan, 'Third'),
 ('male', 44.0, 'Third'),
 ('female', 40.0, 'Second'),
 ('male', 26.0, 'Third'),
 ('male', 17.0, 'Third'),
 ('male', 1.0, 'Third'),
 ('male', 9.0, 'Third'),
 ('female', nan, 'First'),
 ('female', 45.0, 'Third'),
 ('male', nan, 'First'),
 ('male', 28.0, 'Third'),
 ('male', 61.0, 'First'),
 ('male', 4.0, 'Third'),
 ('female', 1.0, 'Third'),
 ('male', 21.0, 'Third'),
 ('male', 56.0, 'First'),
 ('male', 18.0, 'Third'),
 ('male', nan, 'Third'),
 ('female', 50.0, 'First'),
 ('male', 30.0, 'Second'),
 ('male', 36.0, 'Third'),
 ('female', nan, 'Third'),
 ('male', nan, 'Second'),
 ('male', 9.0, 'Third'),
 ('male', 1.0, 'Second'),
 ('female', 4.0, 'Third'),
 ('male', nan, 'First'),
 ('female', nan, 'Third'),
 ('male', 45.0, 'First'),
 ('male', 40.0, 'Third'),
 ('male', 36.0, 'Third'),
 ('female', 32.0, 'Second'),
 ('male', 19.0, 'Second'),
 ('female', 19.0, 'Third'),
 ('male', 3.0, 'Second'),
 ('female', 44.0, 'First'),
 ('female', 58.0, 'First'),
 ('male', nan, 'Third'),
 ('male', 42.0, 'Third'),
 ('female', nan, 'Third'),
 ('female', 24.0, 'Second'),
 ('male', 28.0, 'Third'),
 ('male', nan, 'Third'),
 ('male', 34.0, 'Third'),
 ('male', 45.5, 'Third'),
 ('male', 18.0, 'Third'),
 ('female', 2.0, 'Third'),
 ('male', 32.0, 'Third'),
 ('male', 26.0, 'Third'),
 ('female', 16.0, 'Third'),
 ('male', 40.0, 'First'),
 ('male', 24.0, 'Third'),
 ('female', 35.0, 'Second'),
 ('male', 22.0, 'Third'),
 ('male', 30.0, 'Second'),
 ('male', nan, 'Third'),
 ('female', 31.0, 'First'),
 ('female', 27.0, 'Third'),
 ('male', 42.0, 'Second'),
 ('female', 32.0, 'First'),
 ('male', 30.0, 'Second'),
 ('male', 16.0, 'Third'),
 ('male', 27.0, 'Second'),
 ('male', 51.0, 'Third'),
 ('male', nan, 'Third'),
 ('male', 38.0, 'First'),
 ('male', 22.0, 'Third'),
 ('male', 19.0, 'Second'),
 ('male', 20.5, 'Third'),
 ('male', 18.0, 'Second'),
 ('female', nan, 'Third'),
 ('female', 35.0, 'First'),
 ('male', 29.0, 'Third'),
 ('male', 59.0, 'Second'),
 ('female', 5.0, 'Third'),
 ('male', 24.0, 'Second'),
 ('female', nan, 'Third'),
 ('male', 44.0, 'Second'),
 ('female', 8.0, 'Second'),
 ('male', 19.0, 'Second'),
 ('male', 33.0, 'Second'),
 ('female', nan, 'Third'),
 ('female', nan, 'Third'),
 ('male', 29.0, 'Second'),
 ('male', 22.0, 'Third'),
 ('male', 30.0, 'Third'),
 ('male', 44.0, 'First'),
 ('female', 25.0, 'Third'),
 ('female', 24.0, 'Second'),
 ('male', 37.0, 'First'),
 ('male', 54.0, 'Second'),
 ('male', nan, 'Third'),
 ('female', 29.0, 'Third'),
 ('male', 62.0, 'First'),
 ('male', 30.0, 'Third'),
 ('female', 41.0, 'Third'),
 ('female', 29.0, 'Third'),
 ('female', nan, 'First'),
 ('female', 30.0, 'First'),
 ('female', 35.0, 'First'),
 ('female', 50.0, 'Second'),
 ('male', nan, 'Third'),
 ('male', 3.0, 'Third'),
 ('male', 52.0, 'First'),
 ('male', 40.0, 'First'),
 ('female', nan, 'Third'),
 ('male', 36.0, 'Second'),
 ('male', 16.0, 'Third'),
 ('male', 25.0, 'Third'),
 ('female', 58.0, 'First'),
 ('female', 35.0, 'First'),
 ('male', nan, 'First'),
 ('male', 25.0, 'Third'),
 ('female', 41.0, 'Second'),
 ('male', 37.0, 'First'),
 ('female', nan, 'Third'),
 ('female', 63.0, 'First'),
 ('female', 45.0, 'Third'),
 ('male', nan, 'Second'),
 ('male', 7.0, 'Third'),
 ('female', 35.0, 'Third'),
 ('male', 65.0, 'Third'),
 ('male', 28.0, 'Third'),
 ('male', 16.0, 'Third'),
 ('male', 19.0, 'Third'),
 ('male', nan, 'First'),
 ('male', 33.0, 'Third'),
 ('male', 30.0, 'Third'),
 ('male', 22.0, 'Third'),
 ('male', 42.0, 'Second'),
 ('female', 22.0, 'Third'),
 ('female', 26.0, 'First'),
 ('female', 19.0, 'First'),
 ('male', 36.0, 'Second'),
 ('female', 24.0, 'Third'),
 ('male', 24.0, 'Third'),
 ('male', nan, 'First'),
 ('male', 23.5, 'Third'),
 ('female', 2.0, 'First'),
 ('male', nan, 'First'),
 ('female', 50.0, 'First'),
 ('female', nan, 'Third'),
 ('male', nan, 'Third'),
 ('male', 19.0, 'Third'),
 ('female', nan, 'Second'),
 ('male', nan, 'Third'),
 ('male', 0.92, 'First'),
 ('female', nan, 'First'),
 ('female', 17.0, 'First'),
 ('male', 30.0, 'Second'),
 ('female', 30.0, 'First'),
 ('female', 24.0, 'First'),
 ('female', 18.0, 'First'),
 ('female', 26.0, 'Second'),
 ('male', 28.0, 'Third'),
 ('male', 43.0, 'Second'),
 ('female', 26.0, 'Third'),
 ('female', 24.0, 'Second'),
 ('male', 54.0, 'Second'),
 ('female', 31.0, 'First'),
 ('female', 40.0, 'First'),
 ('male', 22.0, 'Third'),
 ('male', 27.0, 'Third'),
 ('female', 30.0, 'Second'),
 ('female', 22.0, 'Second'),
 ('male', nan, 'Third'),
 ('female', 36.0, 'First'),
 ('male', 61.0, 'Third'),
 ('female', 36.0, 'Second'),
 ('female', 31.0, 'Third'),
 ('female', 16.0, 'First'),
 ('female', nan, 'Third'),
 ('male', 45.5, 'First'),
 ('male', 38.0, 'First'),
 ('male', 16.0, 'Third'),
 ('female', nan, 'First'),
 ('male', nan, 'Third'),
 ('male', 29.0, 'First'),
 ('female', 41.0, 'First'),
 ('male', 45.0, 'Third'),
 ('male', 45.0, 'First'),
 ('male', 2.0, 'Second'),
 ('female', 24.0, 'First'),
 ('male', 28.0, 'Second'),
 ('male', 25.0, 'Second'),
 ('male', 36.0, 'Second'),
 ('female', 24.0, 'Second'),
 ('female', 40.0, 'Second'),
 ('female', nan, 'Third'),
 ('male', 3.0, 'Third'),
 ('male', 42.0, 'Third'),
 ('male', 23.0, 'Third'),
 ('male', nan, 'First'),
 ('male', 15.0, 'Third'),
 ('male', 25.0, 'Third'),
 ('male', nan, 'Third'),
 ('male', 28.0, 'Third'),
 ('female', 22.0, 'First'),
 ('female', 38.0, 'Second'),
 ('female', nan, 'Third'),
 ('female', nan, 'Third'),
 ('male', 40.0, 'Third'),
 ('male', 29.0, 'Second'),
 ('female', 45.0, 'Third'),
 ('male', 35.0, 'Third'),
 ('male', nan, 'Third'),
 ('male', 30.0, 'Third'),
 ('female', 60.0, 'First'),
 ('female', nan, 'Third'),
 ('female', nan, 'Third'),
 ('female', 24.0, 'First'),
 ('male', 25.0, 'First'),
 ('male', 18.0, 'Third'),
 ('male', 19.0, 'Third'),
 ('male', 22.0, 'First'),
 ('female', 3.0, 'Third'),
 ('female', nan, 'First'),
 ('female', 22.0, 'Third'),
 ('male', 27.0, 'First'),
 ('male', 20.0, 'Third'),
 ('male', 19.0, 'Third'),
 ('female', 42.0, 'First'),
 ('female', 1.0, 'Third'),
 ('male', 32.0, 'Third'),
 ('female', 35.0, 'First'),
 ('male', nan, 'Third'),
 ('male', 18.0, 'Second'),
 ('male', 1.0, 'Third'),
 ('female', 36.0, 'Second'),
 ('male', nan, 'Third'),
 ('female', 17.0, 'Second'),
 ('male', 36.0, 'First'),
 ('male', 21.0, 'Third'),
 ('male', 28.0, 'Third'),
 ('female', 23.0, 'First'),
 ('female', 24.0, 'Third'),
 ('male', 22.0, 'Third'),
 ('female', 31.0, 'Third'),
 ('male', 46.0, 'Second'),
 ('male', 23.0, 'Second'),
 ('female', 28.0, 'Second'),
 ('male', 39.0, 'Third'),
 ('male', 26.0, 'Third'),
 ('female', 21.0, 'Third'),
 ('male', 28.0, 'Third'),
 ('female', 20.0, 'Third'),
 ('male', 34.0, 'Second'),
 ('male', 51.0, 'Third'),
 ('male', 3.0, 'Second'),
 ('male', 21.0, 'Third'),
 ('female', nan, 'Third'),
 ('male', nan, 'Third'),
 ('male', nan, 'Third'),
 ('female', 33.0, 'First'),
 ('male', nan, 'Second'),
 ('male', 44.0, 'Third'),
 ('female', nan, 'Third'),
 ('female', 34.0, 'Second'),
 ('female', 18.0, 'Second'),
 ('male', 30.0, 'Second'),
 ('female', 10.0, 'Third'),
 ('male', nan, 'Third'),
 ('male', 21.0, 'Third'),
 ('male', 29.0, 'Third'),
 ('female', 28.0, 'Third'),
 ('male', 18.0, 'Third'),
 ('male', nan, 'Third'),
 ('female', 28.0, 'Second'),
 ('female', 19.0, 'Second'),
 ('male', nan, 'Third'),
 ('male', 32.0, 'Third'),
 ('male', 28.0, 'First'),
 ('female', nan, 'Third'),
 ('female', 42.0, 'Second'),
 ('male', 17.0, 'Third'),
 ('male', 50.0, 'First'),
 ('female', 14.0, 'First'),
 ('female', 21.0, 'Third'),
 ('female', 24.0, 'Second'),
 ('male', 64.0, 'First'),
 ('male', 31.0, 'Second'),
 ('female', 45.0, 'Second'),
 ('male', 20.0, 'Third'),
 ('male', 25.0, 'Third'),
 ('female', 28.0, 'Second'),
 ('male', nan, 'Third'),
 ('male', 4.0, 'First'),
 ('female', 13.0, 'Second'),
 ('male', 34.0, 'First'),
 ('female', 5.0, 'Third'),
 ('male', 52.0, 'First'),
 ('male', 36.0, 'Second'),
 ('male', nan, 'Third'),
 ('male', 30.0, 'First'),
 ('male', 49.0, 'First'),
 ('male', nan, 'Third'),
 ('male', 29.0, 'Third'),
 ('male', 65.0, 'First'),
 ('female', nan, 'First'),
 ('female', 50.0, 'Second'),
 ('male', nan, 'Third'),
 ('male', 48.0, 'First'),
 ('male', 34.0, 'Third'),
 ('male', 47.0, 'First'),
 ('male', 48.0, 'Second'),
 ('male', nan, 'Third'),
 ('male', 38.0, 'Third'),
 ('male', nan, 'Second'),
 ('male', 56.0, 'First'),
 ('male', nan, 'Third'),
 ('female', 0.75, 'Third'),
 ('male', nan, 'Third'),
 ('male', 38.0, 'Third'),
 ('female', 33.0, 'Second'),
 ('female', 23.0, 'Second'),
 ('female', 22.0, 'Third'),
 ('male', nan, 'First'),
 ('male', 34.0, 'Second'),
 ('male', 29.0, 'Third'),
 ('male', 22.0, 'Third'),
 ('female', 2.0, 'Third'),
 ('male', 9.0, 'Third'),
 ('male', nan, 'Second'),
 ('male', 50.0, 'Third'),
 ('female', 63.0, 'Third'),
 ('male', 25.0, 'First'),
 ('female', nan, 'Third'),
 ('female', 35.0, 'First'),
 ('male', 58.0, 'First'),
 ('male', 30.0, 'Third'),
 ('male', 9.0, 'Third'),
 ('male', nan, 'Third'),
 ('male', 21.0, 'Third'),
 ('male', 55.0, 'First'),
 ('male', 71.0, 'First'),
 ('male', 21.0, 'Third'),
 ('male', nan, 'Third'),
 ('female', 54.0, 'First'),
 ('male', nan, 'Third'),
 ('female', 25.0, 'First'),
 ('male', 24.0, 'Third'),
 ('male', 17.0, 'Third'),
 ('female', 21.0, 'Third'),
 ('female', nan, 'Third'),
 ('female', 37.0, 'Third'),
 ('female', 16.0, 'First'),
 ('male', 18.0, 'First'),
 ('female', 33.0, 'Second'),
 ('male', nan, 'First'),
 ('male', 28.0, 'Third'),
 ('male', 26.0, 'Third'),
 ('male', 29.0, 'Third'),
 ('male', nan, 'Third'),
 ('male', 36.0, 'First'),
 ('female', 54.0, 'First'),
 ('male', 24.0, 'Third'),
 ('male', 47.0, 'First'),
 ('female', 34.0, 'Second'),
 ('male', nan, 'Third'),
 ('female', 36.0, 'Second'),
 ('male', 32.0, 'Third'),
 ('female', 30.0, 'First'),
 ('male', 22.0, 'Third'),
 ('male', nan, 'Third'),
 ('female', 44.0, 'First'),
 ('male', nan, 'Third'),
 ('male', 40.5, 'Third'),
 ('female', 50.0, 'Second'),
 ('male', nan, 'First'),
 ('male', 39.0, 'Third'),
 ('male', 23.0, 'Second'),
 ('female', 2.0, 'Second'),
 ('male', nan, 'Third'),
 ('male', 17.0, 'Third'),
 ('female', nan, 'Third'),
 ('female', 30.0, 'Third'),
 ('female', 7.0, 'Second'),
 ('male', 45.0, 'First'),
 ('female', 30.0, 'First'),
 ('male', nan, 'Third'),
 ('female', 22.0, 'First'),
 ('female', 36.0, 'First'),
 ('female', 9.0, 'Third'),
 ('female', 11.0, 'Third'),
 ('male', 32.0, 'Second'),
 ('male', 50.0, 'First'),
 ('male', 64.0, 'First'),
 ('female', 19.0, 'Second'),
 ('male', nan, 'Second'),
 ('male', 33.0, 'Third'),
 ('male', 8.0, 'Second'),
 ('male', 17.0, 'First'),
 ('male', 27.0, 'Second'),
 ('male', nan, 'Third'),
 ('male', 22.0, 'Third'),
 ('female', 22.0, 'Third'),
 ('male', 62.0, 'First'),
 ('female', 48.0, 'First'),
 ('male', nan, 'First'),
 ('female', 39.0, 'First'),
 ('female', 36.0, 'Third'),
 ('male', nan, 'Third'),
 ('male', 40.0, 'Third'),
 ('male', 28.0, 'Second'),
 ('male', nan, 'Third'),
 ('female', nan, 'Third'),
 ('male', 24.0, 'Third'),
 ('male', 19.0, 'Third'),
 ('female', 29.0, 'Third'),
 ('male', nan, 'Third'),
 ('male', 32.0, 'Third'),
 ('male', 62.0, 'Second'),
 ('female', 53.0, 'First'),
 ('male', 36.0, 'First'),
 ('female', nan, 'Third'),
 ('male', 16.0, 'Third'),
 ('male', 19.0, 'Third'),
 ('female', 34.0, 'Second'),
 ('female', 39.0, 'First'),
 ('female', nan, 'Third'),
 ('male', 32.0, 'Third'),
 ('female', 25.0, 'Second'),
 ('female', 39.0, 'First'),
 ('male', 54.0, 'Second'),
 ('male', 36.0, 'First'),
 ('male', nan, 'Third'),
 ('female', 18.0, 'First'),
 ('male', 47.0, 'Second'),
 ('male', 60.0, 'First'),
 ('male', 22.0, 'Third'),
 ('male', nan, 'Third'),
 ('male', 35.0, 'Third'),
 ('female', 52.0, 'First'),
 ('male', 47.0, 'Third'),
 ('female', nan, 'Third'),
 ('male', 37.0, 'Second'),
 ('male', 36.0, 'Third'),
 ('female', nan, 'Second'),
 ('male', 49.0, 'Third'),
 ('male', nan, 'Third'),
 ('male', 49.0, 'First'),
 ('female', 24.0, 'Second'),
 ('male', nan, 'Third'),
 ('male', nan, 'First'),
 ('male', 44.0, 'Third'),
 ('male', 35.0, 'First'),
 ('male', 36.0, 'Third'),
 ('male', 30.0, 'Third'),
 ('male', 27.0, 'First'),
 ('female', 22.0, 'Second'),
 ('female', 40.0, 'First'),
 ('female', 39.0, 'Third'),
 ('male', nan, 'Third'),
 ('female', nan, 'Third'),
 ('male', nan, 'Third'),
 ('male', 35.0, 'Third'),
 ('female', 24.0, 'Second'),
 ('male', 34.0, 'Third'),
 ('female', 26.0, 'Third'),
 ('female', 4.0, 'Second'),
 ('male', 26.0, 'Second'),
 ('male', 27.0, 'Third'),
 ('male', 42.0, 'First'),
 ('male', 20.0, 'Third'),
 ('male', 21.0, 'Third'),
 ('male', 21.0, 'Third'),
 ('male', 61.0, 'First'),
 ('male', 57.0, 'Second'),
 ('female', 21.0, 'First'),
 ('male', 26.0, 'Third'),
 ('male', nan, 'Third'),
 ('male', 80.0, 'First'),
 ('male', 51.0, 'Third'),
 ('male', 32.0, 'First'),
 ('male', nan, 'First'),
 ('female', 9.0, 'Third'),
 ('female', 28.0, 'Second'),
 ('male', 32.0, 'Third'),
 ('male', 31.0, 'Second'),
 ('female', 41.0, 'Third'),
 ('male', nan, 'Third'),
 ('male', 20.0, 'Third'),
 ('female', 24.0, 'First'),
 ('female', 2.0, 'Third'),
 ('male', nan, 'Third'),
 ('female', 0.75, 'Third'),
 ('male', 48.0, 'First'),
 ('male', 19.0, 'Third'),
 ('male', 56.0, 'First'),
 ('male', nan, 'Third'),
 ('female', 23.0, 'Third'),
 ('male', nan, 'Third'),
 ('female', 18.0, 'Second'),
 ('male', 21.0, 'Third'),
 ('female', nan, 'Third'),
 ('female', 18.0, 'Third'),
 ('male', 24.0, 'Second'),
 ('male', nan, 'Third'),
 ('female', 32.0, 'Third'),
 ('male', 23.0, 'Second'),
 ('male', 58.0, 'First'),
 ('male', 50.0, 'First'),
 ('male', 40.0, 'Third'),
 ('male', 47.0, 'First'),
 ('male', 36.0, 'Third'),
 ('male', 20.0, 'Third'),
 ('male', 32.0, 'Second'),
 ('male', 25.0, 'Second'),
 ('male', nan, 'Third'),
 ('male', 43.0, 'Third'),
 ('female', nan, 'First'),
 ('female', 40.0, 'Second'),
 ('male', 31.0, 'First'),
 ('male', 70.0, 'Second'),
 ('male', 31.0, 'Second'),
 ('male', nan, 'Second'),
 ('male', 18.0, 'Third'),
 ('male', 24.5, 'Third'),
 ('female', 18.0, 'Third'),
 ('female', 43.0, 'Third'),
 ('male', 36.0, 'First'),
 ('female', nan, 'Third'),
 ('male', 27.0, 'First'),
 ('male', 20.0, 'Third'),
 ('male', 14.0, 'Third'),
 ('male', 60.0, 'Second'),
 ('male', 25.0, 'Second'),
 ('male', 14.0, 'Third'),
 ('male', 19.0, 'Third'),
 ('male', 18.0, 'Third'),
 ('female', 15.0, 'First'),
 ('male', 31.0, 'First'),
 ('female', 4.0, 'Third'),
 ('male', nan, 'Third'),
 ('male', 25.0, 'Third'),
 ('male', 60.0, 'First'),
 ('male', 52.0, 'Second'),
 ('male', 44.0, 'Third'),
 ('female', nan, 'Third'),
 ('male', 49.0, 'First'),
 ('male', 42.0, 'Third'),
 ('female', 18.0, 'First'),
 ('male', 35.0, 'First'),
 ('female', 18.0, 'Third'),
 ('male', 25.0, 'Third'),
 ('male', 26.0, 'Third'),
 ('male', 39.0, 'Second'),
 ('female', 45.0, 'Second'),
 ('male', 42.0, 'First'),
 ('female', 22.0, 'First'),
 ('male', nan, 'Third'),
 ('female', 24.0, 'First'),
 ('male', nan, 'First'),
 ('male', 48.0, 'First'),
 ('male', 29.0, 'Third'),
 ('male', 52.0, 'Second'),
 ('male', 19.0, 'Third'),
 ('female', 38.0, 'First'),
 ('female', 27.0, 'Second'),
 ('male', nan, 'Third'),
 ('male', 33.0, 'Third'),
 ('female', 6.0, 'Second'),
 ('male', 17.0, 'Third'),
 ('male', 34.0, 'Second'),
 ('male', 50.0, 'Second'),
 ('male', 27.0, 'First'),
 ('male', 20.0, 'Third'),
 ('female', 30.0, 'Second'),
 ('female', nan, 'Third'),
 ('male', 25.0, 'Second'),
 ('female', 25.0, 'Third'),
 ('female', 29.0, 'First'),
 ('male', 11.0, 'Third'),
 ('male', nan, 'Second'),
 ('male', 23.0, 'Second'),
 ('male', 23.0, 'Second'),
 ('male', 28.5, 'Third'),
 ('female', 48.0, 'Third'),
 ('male', 35.0, 'First'),
 ('male', nan, 'Third'),
 ('male', nan, 'Third'),
 ('male', nan, 'First'),
 ('male', 36.0, 'First'),
 ('female', 21.0, 'First'),
 ('male', 24.0, 'Third'),
 ('male', 31.0, 'Third'),
 ('male', 70.0, 'First'),
 ('male', 16.0, 'Third'),
 ('female', 30.0, 'Second'),
 ('male', 19.0, 'First'),
 ('male', 31.0, 'Third'),

In [3]:
[f"{a}_{b}_{c}".upper() for a,b,c in zip(df["sex"],df["age"],df["class"])]

['MALE_22.0_THIRD',
 'FEMALE_38.0_FIRST',
 'FEMALE_26.0_THIRD',
 'FEMALE_35.0_FIRST',
 'MALE_35.0_THIRD',
 'MALE_NAN_THIRD',
 'MALE_54.0_FIRST',
 'MALE_2.0_THIRD',
 'FEMALE_27.0_THIRD',
 'FEMALE_14.0_SECOND',
 'FEMALE_4.0_THIRD',
 'FEMALE_58.0_FIRST',
 'MALE_20.0_THIRD',
 'MALE_39.0_THIRD',
 'FEMALE_14.0_THIRD',
 'FEMALE_55.0_SECOND',
 'MALE_2.0_THIRD',
 'MALE_NAN_SECOND',
 'FEMALE_31.0_THIRD',
 'FEMALE_NAN_THIRD',
 'MALE_35.0_SECOND',
 'MALE_34.0_SECOND',
 'FEMALE_15.0_THIRD',
 'MALE_28.0_FIRST',
 'FEMALE_8.0_THIRD',
 'FEMALE_38.0_THIRD',
 'MALE_NAN_THIRD',
 'MALE_19.0_FIRST',
 'FEMALE_NAN_THIRD',
 'MALE_NAN_THIRD',
 'MALE_40.0_FIRST',
 'FEMALE_NAN_FIRST',
 'FEMALE_NAN_THIRD',
 'MALE_66.0_SECOND',
 'MALE_28.0_FIRST',
 'MALE_42.0_FIRST',
 'MALE_NAN_THIRD',
 'MALE_21.0_THIRD',
 'FEMALE_18.0_THIRD',
 'FEMALE_14.0_THIRD',
 'FEMALE_40.0_THIRD',
 'FEMALE_27.0_SECOND',
 'MALE_NAN_THIRD',
 'FEMALE_3.0_SECOND',
 'FEMALE_19.0_THIRD',
 'MALE_NAN_THIRD',
 'MALE_NAN_THIRD',
 'FEMALE_NAN_THIRD',
 'MALE_NAN_THIRD',
 'FEMALE_18.0_THIRD',
 'MALE_7.0_THIRD',
 'MALE_21.0_THIRD',
 'FEMALE_49.0_FIRST',
 'FEMALE_29.0_SECOND',
 'MALE_65.0_FIRST',
 'MALE_NAN_FIRST',
 'FEMALE_21.0_SECOND',
 'MALE_28.5_THIRD',
 'FEMALE_5.0_SECOND',
 'MALE_11.0_THIRD',
 'MALE_22.0_THIRD',
 'FEMALE_38.0_FIRST',
 'MALE_45.0_FIRST',
 'MALE_4.0_THIRD',
 'MALE_NAN_FIRST',
 'MALE_NAN_THIRD',
 'FEMALE_29.0_SECOND',
 'MALE_19.0_THIRD',
 'FEMALE_17.0_THIRD',
 'MALE_26.0_THIRD',
 'MALE_32.0_SECOND',
 'FEMALE_16.0_THIRD',
 'MALE_21.0_SECOND',
 'MALE_26.0_THIRD',
 'MALE_32.0_THIRD',
 'MALE_25.0_THIRD',
 'MALE_NAN_THIRD',
 'MALE_NAN_THIRD',
 'MALE_0.83_SECOND',
 'FEMALE_30.0_THIRD',
 'MALE_22.0_THIRD',
 'MALE_29.0_THIRD',
 'FEMALE_NAN_THIRD',
 'MALE_28.0_FIRST',
 'FEMALE_17.0_SECOND',
 'FEMALE_33.0_THIRD',
 'MALE_16.0_THIRD',
 'MALE_NAN_THIRD',
 'FEMALE_23.0_FIRST',
 'MALE_24.0_THIRD',
 'MALE_29.0_THIRD',
 'MALE_20.0_THIRD',
 'MALE_46.0_FIRST',
 'MALE_26.0_THIRD',
 'MALE_59.0_THIRD',
 'MALE_NAN_THIRD',
 'MALE_71.0_FIRST',
 'MALE_23.0_FIRST',
 'FEMALE_34.0_SECOND',
 'MALE_34.0_SECOND',
 'FEMALE_28.0_THIRD',
 'MALE_NAN_THIRD',
 'MALE_21.0_FIRST',
 'MALE_33.0_THIRD',
 'MALE_37.0_THIRD',
 'MALE_28.0_THIRD',
 'FEMALE_21.0_THIRD',
 'MALE_NAN_THIRD',
 'MALE_38.0_THIRD',
 'FEMALE_NAN_THIRD',
 'MALE_47.0_FIRST',
 'FEMALE_14.5_THIRD',
 'MALE_22.0_THIRD',
 'FEMALE_20.0_THIRD',
 'FEMALE_17.0_THIRD',
 'MALE_21.0_THIRD',
 'MALE_70.5_THIRD',
 'MALE_29.0_SECOND',
 'MALE_24.0_FIRST',
 'FEMALE_2.0_THIRD',
 'MALE_21.0_SECOND',
 'MALE_NAN_THIRD',
 'MALE_32.5_SECOND',
 'FEMALE_32.5_SECOND',
 'MALE_54.0_FIRST',
 'MALE_12.0_THIRD',
 'MALE_NAN_THIRD',
 'MALE_24.0_THIRD',
 'FEMALE_NAN_THIRD',
 'MALE_45.0_THIRD',
 'MALE_33.0_THIRD',
 'MALE_20.0_THIRD',
 'FEMALE_47.0_THIRD',
 'FEMALE_29.0_SECOND',
 'MALE_25.0_SECOND',
 'MALE_23.0_SECOND',
 'FEMALE_19.0_FIRST',
 'MALE_37.0_FIRST',
 'MALE_16.0_THIRD',
 'MALE_24.0_FIRST',
 'FEMALE_NAN_THIRD',
 'FEMALE_22.0_THIRD',
 'FEMALE_24.0_THIRD',
 'MALE_19.0_THIRD',
 'MALE_18.0_SECOND',
 'MALE_19.0_SECOND',
 'MALE_27.0_THIRD',
 'FEMALE_9.0_THIRD',
 'MALE_36.5_SECOND',
 'MALE_42.0_SECOND',
 'MALE_51.0_SECOND',
 'FEMALE_22.0_FIRST',
 'MALE_55.5_THIRD',
 'MALE_40.5_THIRD',
 'MALE_NAN_THIRD',
 'MALE_51.0_FIRST',
 'FEMALE_16.0_THIRD',
 'MALE_30.0_THIRD',
 'MALE_NAN_THIRD',
 'MALE_NAN_THIRD',
 'MALE_44.0_THIRD',
 'FEMALE_40.0_SECOND',
 'MALE_26.0_THIRD',
 'MALE_17.0_THIRD',
 'MALE_1.0_THIRD',
 'MALE_9.0_THIRD',
 'FEMALE_NAN_FIRST',
 'FEMALE_45.0_THIRD',
 'MALE_NAN_FIRST',
 'MALE_28.0_THIRD',
 'MALE_61.0_FIRST',
 'MALE_4.0_THIRD',
 'FEMALE_1.0_THIRD',
 'MALE_21.0_THIRD',
 'MALE_56.0_FIRST',
 'MALE_18.0_THIRD',
 'MALE_NAN_THIRD',
 'FEMALE_50.0_FIRST',
 'MALE_30.0_SECOND',
 'MALE_36.0_THIRD',
 'FEMALE_NAN_THIRD',
 'MALE_NAN_SECOND',
 'MALE_9.0_THIRD',
 'MALE_1.0_SECOND',
 'FEMALE_4.0_THIRD',
 'MALE_NAN_FIRST',
 'FEMALE_NAN_THIRD',
 'MALE_45.0_FIRST',
 'MALE_40.0_THIRD',
 'MALE_36.0_THIRD',
 'FEMALE_32.0_SECOND',
 'MALE_19.0_SECOND',
 'FEMALE_19.0_THIRD',
 'MALE_3.0_SECOND',
 'FEMALE_44.0_FIRST',
 'FEMALE_58.0_FIRST',
 'MALE_NAN_THIRD',
 'MALE_42.0_THIRD',
 'FEMALE_NAN_THIRD',
 'FEMALE_24.0_SECOND',
 'MALE_28.0_THIRD',
 'MALE_NAN_THIRD',
 'MALE_34.0_THIRD',
 'MALE_45.5_THIRD',
 'MALE_18.0_THIRD',
 'FEMALE_2.0_THIRD',
 'MALE_32.0_THIRD',
 'MALE_26.0_THIRD',
 'FEMALE_16.0_THIRD',
 'MALE_40.0_FIRST',
 'MALE_24.0_THIRD',
 'FEMALE_35.0_SECOND',
 'MALE_22.0_THIRD',
 'MALE_30.0_SECOND',
 'MALE_NAN_THIRD',
 'FEMALE_31.0_FIRST',
 'FEMALE_27.0_THIRD',
 'MALE_42.0_SECOND',
 'FEMALE_32.0_FIRST',
 'MALE_30.0_SECOND',
 'MALE_16.0_THIRD',
 'MALE_27.0_SECOND',
 'MALE_51.0_THIRD',
 'MALE_NAN_THIRD',
 'MALE_38.0_FIRST',
 'MALE_22.0_THIRD',
 'MALE_19.0_SECOND',
 'MALE_20.5_THIRD',
 'MALE_18.0_SECOND',
 'FEMALE_NAN_THIRD',
 'FEMALE_35.0_FIRST',
 'MALE_29.0_THIRD',
 'MALE_59.0_SECOND',
 'FEMALE_5.0_THIRD',
 'MALE_24.0_SECOND',
 'FEMALE_NAN_THIRD',
 'MALE_44.0_SECOND',
 'FEMALE_8.0_SECOND',
 'MALE_19.0_SECOND',
 'MALE_33.0_SECOND',
 'FEMALE_NAN_THIRD',
 'FEMALE_NAN_THIRD',
 'MALE_29.0_SECOND',
 'MALE_22.0_THIRD',
 'MALE_30.0_THIRD',
 'MALE_44.0_FIRST',
 'FEMALE_25.0_THIRD',
 'FEMALE_24.0_SECOND',
 'MALE_37.0_FIRST',
 'MALE_54.0_SECOND',
 'MALE_NAN_THIRD',
 'FEMALE_29.0_THIRD',
 'MALE_62.0_FIRST',
 'MALE_30.0_THIRD',
 'FEMALE_41.0_THIRD',
 'FEMALE_29.0_THIRD',
 'FEMALE_NAN_FIRST',
 'FEMALE_30.0_FIRST',
 'FEMALE_35.0_FIRST',
 'FEMALE_50.0_SECOND',
 'MALE_NAN_THIRD',
 'MALE_3.0_THIRD',
 'MALE_52.0_FIRST',
 'MALE_40.0_FIRST',
 'FEMALE_NAN_THIRD',
 'MALE_36.0_SECOND',
 'MALE_16.0_THIRD',
 'MALE_25.0_THIRD',
 'FEMALE_58.0_FIRST',
 'FEMALE_35.0_FIRST',
 'MALE_NAN_FIRST',
 'MALE_25.0_THIRD',
 'FEMALE_41.0_SECOND',
 'MALE_37.0_FIRST',
 'FEMALE_NAN_THIRD',
 'FEMALE_63.0_FIRST',
 'FEMALE_45.0_THIRD',
 'MALE_NAN_SECOND',
 'MALE_7.0_THIRD',
 'FEMALE_35.0_THIRD',
 'MALE_65.0_THIRD',
 'MALE_28.0_THIRD',
 'MALE_16.0_THIRD',
 'MALE_19.0_THIRD',
 'MALE_NAN_FIRST',
 'MALE_33.0_THIRD',
 'MALE_30.0_THIRD',
 'MALE_22.0_THIRD',
 'MALE_42.0_SECOND',
 'FEMALE_22.0_THIRD',
 'FEMALE_26.0_FIRST',
 'FEMALE_19.0_FIRST',
 'MALE_36.0_SECOND',
 'FEMALE_24.0_THIRD',
 'MALE_24.0_THIRD',
 'MALE_NAN_FIRST',
 'MALE_23.5_THIRD',
 'FEMALE_2.0_FIRST',
 'MALE_NAN_FIRST',
 'FEMALE_50.0_FIRST',
 'FEMALE_NAN_THIRD',
 'MALE_NAN_THIRD',
 'MALE_19.0_THIRD',
 'FEMALE_NAN_SECOND',
 'MALE_NAN_THIRD',
 'MALE_0.92_FIRST',
 'FEMALE_NAN_FIRST',
 'FEMALE_17.0_FIRST',
 'MALE_30.0_SECOND',
 'FEMALE_30.0_FIRST',
 'FEMALE_24.0_FIRST',
 'FEMALE_18.0_FIRST',
 'FEMALE_26.0_SECOND',
 'MALE_28.0_THIRD',
 'MALE_43.0_SECOND',
 'FEMALE_26.0_THIRD',
 'FEMALE_24.0_SECOND',
 'MALE_54.0_SECOND',
 'FEMALE_31.0_FIRST',
 'FEMALE_40.0_FIRST',
 'MALE_22.0_THIRD',
 'MALE_27.0_THIRD',
 'FEMALE_30.0_SECOND',
 'FEMALE_22.0_SECOND',
 'MALE_NAN_THIRD',
 'FEMALE_36.0_FIRST',
 'MALE_61.0_THIRD',
 'FEMALE_36.0_SECOND',
 'FEMALE_31.0_THIRD',
 'FEMALE_16.0_FIRST',
 'FEMALE_NAN_THIRD',
 'MALE_45.5_FIRST',
 'MALE_38.0_FIRST',
 'MALE_16.0_THIRD',
 'FEMALE_NAN_FIRST',
 'MALE_NAN_THIRD',
 'MALE_29.0_FIRST',
 'FEMALE_41.0_FIRST',
 'MALE_45.0_THIRD',
 'MALE_45.0_FIRST',
 'MALE_2.0_SECOND',
 'FEMALE_24.0_FIRST',
 'MALE_28.0_SECOND',
 'MALE_25.0_SECOND',
 'MALE_36.0_SECOND',
 'FEMALE_24.0_SECOND',
 'FEMALE_40.0_SECOND',
 'FEMALE_NAN_THIRD',
 'MALE_3.0_THIRD',
 'MALE_42.0_THIRD',
 'MALE_23.0_THIRD',
 'MALE_NAN_FIRST',
 'MALE_15.0_THIRD',
 'MALE_25.0_THIRD',
 'MALE_NAN_THIRD',
 'MALE_28.0_THIRD',
 'FEMALE_22.0_FIRST',
 'FEMALE_38.0_SECOND',
 'FEMALE_NAN_THIRD',
 'FEMALE_NAN_THIRD',
 'MALE_40.0_THIRD',
 'MALE_29.0_SECOND',
 'FEMALE_45.0_THIRD',
 'MALE_35.0_THIRD',
 'MALE_NAN_THIRD',
 'MALE_30.0_THIRD',
 'FEMALE_60.0_FIRST',
 'FEMALE_NAN_THIRD',
 'FEMALE_NAN_THIRD',
 'FEMALE_24.0_FIRST',
 'MALE_25.0_FIRST',
 'MALE_18.0_THIRD',
 'MALE_19.0_THIRD',
 'MALE_22.0_FIRST',
 'FEMALE_3.0_THIRD',
 'FEMALE_NAN_FIRST',
 'FEMALE_22.0_THIRD',
 'MALE_27.0_FIRST',
 'MALE_20.0_THIRD',
 'MALE_19.0_THIRD',
 'FEMALE_42.0_FIRST',
 'FEMALE_1.0_THIRD',
 'MALE_32.0_THIRD',
 'FEMALE_35.0_FIRST',
 'MALE_NAN_THIRD',
 'MALE_18.0_SECOND',
 'MALE_1.0_THIRD',
 'FEMALE_36.0_SECOND',
 'MALE_NAN_THIRD',
 'FEMALE_17.0_SECOND',
 'MALE_36.0_FIRST',
 'MALE_21.0_THIRD',
 'MALE_28.0_THIRD',
 'FEMALE_23.0_FIRST',
 'FEMALE_24.0_THIRD',
 'MALE_22.0_THIRD',
 'FEMALE_31.0_THIRD',
 'MALE_46.0_SECOND',
 'MALE_23.0_SECOND',
 'FEMALE_28.0_SECOND',
 'MALE_39.0_THIRD',
 'MALE_26.0_THIRD',
 'FEMALE_21.0_THIRD',
 'MALE_28.0_THIRD',
 'FEMALE_20.0_THIRD',
 'MALE_34.0_SECOND',
 'MALE_51.0_THIRD',
 'MALE_3.0_SECOND',
 'MALE_21.0_THIRD',
 'FEMALE_NAN_THIRD',
 'MALE_NAN_THIRD',
 'MALE_NAN_THIRD',
 'FEMALE_33.0_FIRST',
 'MALE_NAN_SECOND',
 'MALE_44.0_THIRD',
 'FEMALE_NAN_THIRD',
 'FEMALE_34.0_SECOND',
 'FEMALE_18.0_SECOND',
 'MALE_30.0_SECOND',
 'FEMALE_10.0_THIRD',
 'MALE_NAN_THIRD',
 'MALE_21.0_THIRD',
 'MALE_29.0_THIRD',
 'FEMALE_28.0_THIRD',
 'MALE_18.0_THIRD',
 'MALE_NAN_THIRD',
 'FEMALE_28.0_SECOND',
 'FEMALE_19.0_SECOND',
 'MALE_NAN_THIRD',
 'MALE_32.0_THIRD',
 'MALE_28.0_FIRST',
 'FEMALE_NAN_THIRD',
 'FEMALE_42.0_SECOND',
 'MALE_17.0_THIRD',
 'MALE_50.0_FIRST',
 'FEMALE_14.0_FIRST',
 'FEMALE_21.0_THIRD',
 'FEMALE_24.0_SECOND',
 'MALE_64.0_FIRST',
 'MALE_31.0_SECOND',
 'FEMALE_45.0_SECOND',
 'MALE_20.0_THIRD',
 'MALE_25.0_THIRD',
 'FEMALE_28.0_SECOND',
 'MALE_NAN_THIRD',
 'MALE_4.0_FIRST',
 'FEMALE_13.0_SECOND',
 'MALE_34.0_FIRST',
 'FEMALE_5.0_THIRD',
 'MALE_52.0_FIRST',
 'MALE_36.0_SECOND',
 'MALE_NAN_THIRD',
 'MALE_30.0_FIRST',
 'MALE_49.0_FIRST',
 'MALE_NAN_THIRD',
 'MALE_29.0_THIRD',
 'MALE_65.0_FIRST',
 'FEMALE_NAN_FIRST',
 'FEMALE_50.0_SECOND',
 'MALE_NAN_THIRD',
 'MALE_48.0_FIRST',
 'MALE_34.0_THIRD',
 'MALE_47.0_FIRST',
 'MALE_48.0_SECOND',
 'MALE_NAN_THIRD',
 'MALE_38.0_THIRD',
 'MALE_NAN_SECOND',
 'MALE_56.0_FIRST',
 'MALE_NAN_THIRD',
 'FEMALE_0.75_THIRD',
 'MALE_NAN_THIRD',
 'MALE_38.0_THIRD',
 'FEMALE_33.0_SECOND',
 'FEMALE_23.0_SECOND',
 'FEMALE_22.0_THIRD',
 'MALE_NAN_FIRST',
 'MALE_34.0_SECOND',
 'MALE_29.0_THIRD',
 'MALE_22.0_THIRD',
 'FEMALE_2.0_THIRD',
 'MALE_9.0_THIRD',
 'MALE_NAN_SECOND',
 'MALE_50.0_THIRD',
 'FEMALE_63.0_THIRD',
 'MALE_25.0_FIRST',
 'FEMALE_NAN_THIRD',
 'FEMALE_35.0_FIRST',
 'MALE_58.0_FIRST',
 'MALE_30.0_THIRD',
 'MALE_9.0_THIRD',
 'MALE_NAN_THIRD',
 'MALE_21.0_THIRD',
 'MALE_55.0_FIRST',
 'MALE_71.0_FIRST',
 'MALE_21.0_THIRD',
 'MALE_NAN_THIRD',
 'FEMALE_54.0_FIRST',
 'MALE_NAN_THIRD',
 'FEMALE_25.0_FIRST',
 'MALE_24.0_THIRD',
 'MALE_17.0_THIRD',
 'FEMALE_21.0_THIRD',
 'FEMALE_NAN_THIRD',
 'FEMALE_37.0_THIRD',
 'FEMALE_16.0_FIRST',
 'MALE_18.0_FIRST',
 'FEMALE_33.0_SECOND',
 'MALE_NAN_FIRST',
 'MALE_28.0_THIRD',
 'MALE_26.0_THIRD',
 'MALE_29.0_THIRD',
 'MALE_NAN_THIRD',
 'MALE_36.0_FIRST',
 'FEMALE_54.0_FIRST',
 'MALE_24.0_THIRD',
 'MALE_47.0_FIRST',
 'FEMALE_34.0_SECOND',
 'MALE_NAN_THIRD',
 'FEMALE_36.0_SECOND',
 'MALE_32.0_THIRD',
 'FEMALE_30.0_FIRST',
 'MALE_22.0_THIRD',
 'MALE_NAN_THIRD',
 'FEMALE_44.0_FIRST',
 'MALE_NAN_THIRD',
 'MALE_40.5_THIRD',
 'FEMALE_50.0_SECOND',
 'MALE_NAN_FIRST',
 'MALE_39.0_THIRD',
 'MALE_23.0_SECOND',
 'FEMALE_2.0_SECOND',
 'MALE_NAN_THIRD',
 'MALE_17.0_THIRD',
 'FEMALE_NAN_THIRD',
 'FEMALE_30.0_THIRD',
 'FEMALE_7.0_SECOND',
 'MALE_45.0_FIRST',
 'FEMALE_30.0_FIRST',
 'MALE_NAN_THIRD',
 'FEMALE_22.0_FIRST',
 'FEMALE_36.0_FIRST',
 'FEMALE_9.0_THIRD',
 'FEMALE_11.0_THIRD',
 'MALE_32.0_SECOND',
 'MALE_50.0_FIRST',
 'MALE_64.0_FIRST',
 'FEMALE_19.0_SECOND',
 'MALE_NAN_SECOND',
 'MALE_33.0_THIRD',
 'MALE_8.0_SECOND',
 'MALE_17.0_FIRST',
 'MALE_27.0_SECOND',
 'MALE_NAN_THIRD',
 'MALE_22.0_THIRD',
 'FEMALE_22.0_THIRD',
 'MALE_62.0_FIRST',
 'FEMALE_48.0_FIRST',
 'MALE_NAN_FIRST',
 'FEMALE_39.0_FIRST',
 'FEMALE_36.0_THIRD',
 'MALE_NAN_THIRD',
 'MALE_40.0_THIRD',
 'MALE_28.0_SECOND',
 'MALE_NAN_THIRD',
 'FEMALE_NAN_THIRD',
 'MALE_24.0_THIRD',
 'MALE_19.0_THIRD',
 'FEMALE_29.0_THIRD',
 'MALE_NAN_THIRD',
 'MALE_32.0_THIRD',
 'MALE_62.0_SECOND',
 'FEMALE_53.0_FIRST',
 'MALE_36.0_FIRST',
 'FEMALE_NAN_THIRD',
 'MALE_16.0_THIRD',
 'MALE_19.0_THIRD',
 'FEMALE_34.0_SECOND',
 'FEMALE_39.0_FIRST',
 'FEMALE_NAN_THIRD',
 'MALE_32.0_THIRD',
 'FEMALE_25.0_SECOND',
 'FEMALE_39.0_FIRST',
 'MALE_54.0_SECOND',
 'MALE_36.0_FIRST',
 'MALE_NAN_THIRD',
 'FEMALE_18.0_FIRST',
 'MALE_47.0_SECOND',
 'MALE_60.0_FIRST',
 'MALE_22.0_THIRD',
 'MALE_NAN_THIRD',
 'MALE_35.0_THIRD',
 'FEMALE_52.0_FIRST',
 'MALE_47.0_THIRD',
 'FEMALE_NAN_THIRD',
 'MALE_37.0_SECOND',
 'MALE_36.0_THIRD',
 'FEMALE_NAN_SECOND',
 'MALE_49.0_THIRD',
 'MALE_NAN_THIRD',
 'MALE_49.0_FIRST',
 'FEMALE_24.0_SECOND',
 'MALE_NAN_THIRD',
 'MALE_NAN_FIRST',
 'MALE_44.0_THIRD',
 'MALE_35.0_FIRST',
 'MALE_36.0_THIRD',
 'MALE_30.0_THIRD',
 'MALE_27.0_FIRST',
 'FEMALE_22.0_SECOND',
 'FEMALE_40.0_FIRST',
 'FEMALE_39.0_THIRD',
 'MALE_NAN_THIRD',
 'FEMALE_NAN_THIRD',
 'MALE_NAN_THIRD',
 'MALE_35.0_THIRD',
 'FEMALE_24.0_SECOND',
 'MALE_34.0_THIRD',
 'FEMALE_26.0_THIRD',
 'FEMALE_4.0_SECOND',
 'MALE_26.0_SECOND',
 'MALE_27.0_THIRD',
 'MALE_42.0_FIRST',
 'MALE_20.0_THIRD',
 'MALE_21.0_THIRD',
 'MALE_21.0_THIRD',
 'MALE_61.0_FIRST',
 'MALE_57.0_SECOND',
 'FEMALE_21.0_FIRST',
 'MALE_26.0_THIRD',
 'MALE_NAN_THIRD',
 'MALE_80.0_FIRST',
 'MALE_51.0_THIRD',
 'MALE_32.0_FIRST',
 'MALE_NAN_FIRST',
 'FEMALE_9.0_THIRD',
 'FEMALE_28.0_SECOND',
 'MALE_32.0_THIRD',
 'MALE_31.0_SECOND',
 'FEMALE_41.0_THIRD',
 'MALE_NAN_THIRD',
 'MALE_20.0_THIRD',
 'FEMALE_24.0_FIRST',
 'FEMALE_2.0_THIRD',
 'MALE_NAN_THIRD',
 'FEMALE_0.75_THIRD',
 'MALE_48.0_FIRST',
 'MALE_19.0_THIRD',
 'MALE_56.0_FIRST',
 'MALE_NAN_THIRD',
 'FEMALE_23.0_THIRD',
 'MALE_NAN_THIRD',
 'FEMALE_18.0_SECOND',
 'MALE_21.0_THIRD',
 'FEMALE_NAN_THIRD',
 'FEMALE_18.0_THIRD',
 'MALE_24.0_SECOND',
 'MALE_NAN_THIRD',
 'FEMALE_32.0_THIRD',
 'MALE_23.0_SECOND',
 'MALE_58.0_FIRST',
 'MALE_50.0_FIRST',
 'MALE_40.0_THIRD',
 'MALE_47.0_FIRST',
 'MALE_36.0_THIRD',
 'MALE_20.0_THIRD',
 'MALE_32.0_SECOND',
 'MALE_25.0_SECOND',
 'MALE_NAN_THIRD',
 'MALE_43.0_THIRD',
 'FEMALE_NAN_FIRST',
 'FEMALE_40.0_SECOND',
 'MALE_31.0_FIRST',
 'MALE_70.0_SECOND',
 'MALE_31.0_SECOND',
 'MALE_NAN_SECOND',
 'MALE_18.0_THIRD',
 'MALE_24.5_THIRD',
 'FEMALE_18.0_THIRD',
 'FEMALE_43.0_THIRD',
 'MALE_36.0_FIRST',
 'FEMALE_NAN_THIRD',
 'MALE_27.0_FIRST',
 'MALE_20.0_THIRD',
 'MALE_14.0_THIRD',
 'MALE_60.0_SECOND',
 'MALE_25.0_SECOND',
 'MALE_14.0_THIRD',
 'MALE_19.0_THIRD',
 'MALE_18.0_THIRD',
 'FEMALE_15.0_FIRST',
 'MALE_31.0_FIRST',
 'FEMALE_4.0_THIRD',
 'MALE_NAN_THIRD',
 'MALE_25.0_THIRD',
 'MALE_60.0_FIRST',
 'MALE_52.0_SECOND',
 'MALE_44.0_THIRD',
 'FEMALE_NAN_THIRD',
 'MALE_49.0_FIRST',
 'MALE_42.0_THIRD',
 'FEMALE_18.0_FIRST',
 'MALE_35.0_FIRST',
 'FEMALE_18.0_THIRD',
 'MALE_25.0_THIRD',
 'MALE_26.0_THIRD',
 'MALE_39.0_SECOND',
 'FEMALE_45.0_SECOND',
 'MALE_42.0_FIRST',
 'FEMALE_22.0_FIRST',
 'MALE_NAN_THIRD',
 'FEMALE_24.0_FIRST',
 'MALE_NAN_FIRST',
 'MALE_48.0_FIRST',
 'MALE_29.0_THIRD',
 'MALE_52.0_SECOND',
 'MALE_19.0_THIRD',
 'FEMALE_38.0_FIRST',
 'FEMALE_27.0_SECOND',
 'MALE_NAN_THIRD',
 'MALE_33.0_THIRD',
 'FEMALE_6.0_SECOND',
 'MALE_17.0_THIRD',
 'MALE_34.0_SECOND',
 'MALE_50.0_SECOND',
 'MALE_27.0_FIRST',
 'MALE_20.0_THIRD',
 'FEMALE_30.0_SECOND',
 'FEMALE_NAN_THIRD',
 'MALE_25.0_SECOND',
 'FEMALE_25.0_THIRD',
 'FEMALE_29.0_FIRST',
 'MALE_11.0_THIRD',
 'MALE_NAN_SECOND',
 'MALE_23.0_SECOND',
 'MALE_23.0_SECOND',
 'MALE_28.5_THIRD',
 'FEMALE_48.0_THIRD',
 'MALE_35.0_FIRST',
 'MALE_NAN_THIRD',
 'MALE_NAN_THIRD',
 'MALE_NAN_FIRST',
 'MALE_36.0_FIRST',
 'FEMALE_21.0_FIRST',
 'MALE_24.0_THIRD',
 'MALE_31.0_THIRD',
 'MALE_70.0_FIRST',
 'MALE_16.0_THIRD',
 'FEMALE_30.0_SECOND',
 'MALE_19.0_FIRST',
 'MALE_31.0_THIRD',
 'FEMALE_4.0_SECOND',
 'MALE_6.0_THIRD',
 'MALE_33.0_THIRD',
 'MALE_23.0_THIRD',
 'FEMALE_48.0_SECOND',
 'MALE_0.67_SECOND',
 'MALE_28.0_THIRD',
 'MALE_18.0_SECOND',
 'MALE_34.0_THIRD',
 'FEMALE_33.0_FIRST',
 'MALE_NAN_THIRD',
 'MALE_41.0_THIRD',
 'MALE_20.0_THIRD',
 'FEMALE_36.0_FIRST',
 'MALE_16.0_THIRD',
 'FEMALE_51.0_FIRST',
 'MALE_NAN_FIRST',
 'FEMALE_30.5_THIRD',
 'MALE_NAN_THIRD',
 'MALE_32.0_THIRD',
 'MALE_24.0_THIRD',
 'MALE_48.0_THIRD',
 'FEMALE_57.0_SECOND',
 'MALE_NAN_THIRD',
 'FEMALE_54.0_SECOND',
 'MALE_18.0_THIRD',
 'MALE_NAN_THIRD',
 'FEMALE_5.0_THIRD',
 'MALE_NAN_THIRD',
 'FEMALE_43.0_FIRST',
 'FEMALE_13.0_THIRD',
 'FEMALE_17.0_FIRST',
 'MALE_29.0_FIRST',
 'MALE_NAN_THIRD',
 'MALE_25.0_THIRD',
 'MALE_25.0_THIRD',
 'FEMALE_18.0_THIRD',
 'MALE_8.0_THIRD',
 'MALE_1.0_THIRD',
 'MALE_46.0_FIRST',
 'MALE_NAN_THIRD',
 'MALE_16.0_SECOND',
 'FEMALE_NAN_THIRD',
 'MALE_NAN_FIRST',
 'MALE_25.0_THIRD',
 'MALE_39.0_SECOND',
 'FEMALE_49.0_FIRST',
 'FEMALE_31.0_THIRD',
 'MALE_30.0_THIRD',
 'FEMALE_30.0_THIRD',
 'MALE_34.0_SECOND',
 'FEMALE_31.0_SECOND',
 'MALE_11.0_FIRST',
 'MALE_0.42_THIRD',
 'MALE_27.0_THIRD',
 'MALE_31.0_THIRD',
 'MALE_39.0_FIRST',
 'FEMALE_18.0_THIRD',
 'MALE_39.0_SECOND',
 'FEMALE_33.0_FIRST',
 'MALE_26.0_THIRD',
 'MALE_39.0_THIRD',
 'MALE_35.0_SECOND',
 'FEMALE_6.0_THIRD',
 'MALE_30.5_THIRD',
 'MALE_NAN_FIRST',
 'FEMALE_23.0_THIRD',
 'MALE_31.0_SECOND',
 'MALE_43.0_THIRD',
 'MALE_10.0_THIRD',
 'FEMALE_52.0_FIRST',
 'MALE_27.0_THIRD',
 'MALE_38.0_FIRST',
 'FEMALE_27.0_THIRD',
 'MALE_2.0_THIRD',
 'MALE_NAN_THIRD',
 'MALE_NAN_THIRD',
 'MALE_1.0_SECOND',
 'MALE_NAN_THIRD',
 'FEMALE_62.0_FIRST',
 'FEMALE_15.0_THIRD',
 'MALE_0.83_SECOND',
 'MALE_NAN_THIRD',
 'MALE_23.0_THIRD',
 'MALE_18.0_THIRD',
 'FEMALE_39.0_FIRST',
 'MALE_21.0_THIRD',
 'MALE_NAN_THIRD',
 'MALE_32.0_THIRD',
 'MALE_NAN_FIRST',
 'MALE_20.0_THIRD',
 'MALE_16.0_SECOND',
 'FEMALE_30.0_FIRST',
 'MALE_34.5_THIRD',
 'MALE_17.0_THIRD',
 'MALE_42.0_THIRD',
 'MALE_NAN_THIRD',
 'MALE_35.0_THIRD',
 'MALE_28.0_SECOND',
 'FEMALE_NAN_FIRST',
 'MALE_4.0_THIRD',
 'MALE_74.0_THIRD',
 'FEMALE_9.0_THIRD',
 'FEMALE_16.0_FIRST',
 'FEMALE_44.0_SECOND',
 'FEMALE_18.0_THIRD',
 'FEMALE_45.0_FIRST',
 'MALE_51.0_FIRST',
 'FEMALE_24.0_THIRD',
 'MALE_NAN_THIRD',
 'MALE_41.0_THIRD',
 'MALE_21.0_SECOND',
 'FEMALE_48.0_FIRST',
 'FEMALE_NAN_THIRD',
 'MALE_24.0_SECOND',
 'FEMALE_42.0_SECOND',
 'FEMALE_27.0_SECOND',
 'MALE_31.0_FIRST',
 'MALE_NAN_THIRD',
 'MALE_4.0_THIRD',
 'MALE_26.0_THIRD',
 'FEMALE_47.0_FIRST',
 'MALE_33.0_FIRST',
 'MALE_47.0_THIRD',
 'FEMALE_28.0_SECOND',
 'FEMALE_15.0_THIRD',
 'MALE_20.0_THIRD',
 'MALE_19.0_THIRD',
 'MALE_NAN_THIRD',
 'FEMALE_56.0_FIRST',
 'FEMALE_25.0_SECOND',
 'MALE_33.0_THIRD',
 'FEMALE_22.0_THIRD',
 'MALE_28.0_SECOND',
 'MALE_25.0_THIRD',
 'FEMALE_39.0_THIRD',
 'MALE_27.0_SECOND',
 'FEMALE_19.0_FIRST',
 'FEMALE_NAN_THIRD',
 'MALE_26.0_FIRST',
 'MALE_32.0_THIRD']

In [8]:
df.loc[:,df.columns.isin(["age"])]

      age
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
..    ...
886  27.0
887  19.0
888   NaN
889  26.0
890  32.0

[891 rows x 1 columns]

In [9]:
df.loc[:,df.columns.str.contains("age|fare")]

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [10]:
df.loc[:,~df.columns.str.contains("age|fare")]

,survived,pclass,sex,sibsp,parch,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,1,0,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,1,0,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,0,0,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,1,0,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,0,0,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,0,0,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,0,0,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,1,2,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,0,0,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,0,0,Q,Third,man,True,NaN,Queenstown,no,True

In [11]:
df.set_index("age").iloc[0:3]

,survived,pclass,sex,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
age,,,,,,,,,,,,,,
22.0,0,3,male,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
38.0,1,1,female,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
26.0,1,3,female,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [12]:
df.set_index("age").loc[[22,23]]

,survived,pclass,sex,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
age,,,,,,,,,,,,,,
22.0,0,3,male,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
22.0,0,3,male,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
22.0,0,3,male,0,0,9.0000,S,Third,man,True,NaN,Southampton,no,True
22.0,0,3,male,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
22.0,1,3,female,0,0,7.7500,S,Third,woman,False,NaN,Southampton,yes,True
22.0,1,1,female,1,0,66.6000,S,First,woman,False,C,Southampton,yes,False
22.0,0,3,male,0,0,7.2500,S,Third,man,True,NaN,Southampton,no,True
22.0,0,3,male,0,0,9.3500,S,Third,man,True,NaN,Southampton,no,True
22.0,0,3,male,0,0,7.1250,S,Third,man,True,NaN,Southampton,no,True
22.0,0,3,male,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
22.0,1,3,female,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True
22.0,0,3,male,0,0,7.2500,S,Third,man,True,NaN,Southampton,no,True
22.0,1,2,female,1,1,29.0000,S,Second,woman,False,NaN,Southampton,yes,False
22.0,1,1,female,0,1,55.0000,S,First,woman,False,E,Southampton,yes,False
22.0,0,1,male,0,0,135.6333,C,First,man,True,NaN,Cherbourg,no,True
22.0,1,3,female,0,0,7.2500,S,Third,woman,False,NaN,Southampton,yes,True
22.0,0,3,male,0,0,7.7958,S,Third,man,True,NaN,Southampton,no,True
22.0,0,3,female,0,0,9.8375,S,Third,woman,False,NaN,Southampton,no,True
22.0,0,3,male,0,0,7.5208,S,Third,man,True,NaN,Southampton,no,True
22.0,0,3,male,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
22.0,1,1,female,0,2,49.5000,C,First,woman,False,B,Cherbourg,yes,False
22.0,1,3,male,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,yes,True
22.0,1,3,female,0,0,7.7750,S,Third,woman,False,NaN,Southampton,yes,True
22.0,0,3,male,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
22.0,1,2,female,1,2,41.5792,C,Second,woman,False,NaN,Cherbourg,yes,False
22.0,1,1,female,0,0,151.5500,S,First,woman,False,NaN,Southampton,yes,True
22.0,0,3,female,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
23.0,1,1,female,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False
23.0,1,1,male,0,1,63.3583,C,First,man,True,D,Cherbourg,yes,False
23.0,0,2,male,0,0,15.0458,C,Second,man,True,NaN,Cherbourg,no,True
23.0,0,3,male,0,0,9.2250,S,Third,man,True,NaN,Southampton,no,True
23.0,1,1,female,1,0,113.2750,C,First,woman,False,D,Cherbourg,yes,False
23.0,0,2,male,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
23.0,1,2,female,0,0,13.7917,C,Second,woman,False,D,Cherbourg,yes,True
23.0,0,2,male,2,1,11.5000,S,Second,man,True,NaN,Southampton,no,False
23.0,1,3,female,0,0,7.5500,S,Third,woman,False,NaN,Southampton,yes,True
23.0,0,2,male,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
23.0,0,2,male,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
23.0,0,2,male,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
23.0,0,3,male,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
23.0,0,3,female,0,0,7.9250,S,Third,woman,False,NaN,Southampton,no,True
23.0,0,3,male,0,0,7.8542,S,Third,man,True,NaN,Southampton,no,True

In [13]:
df.set_index("age").sort_index().loc[22:23,:]

,survived,pclass,sex,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
age,,,,,,,,,,,,,,
22.0,0,3,male,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
22.0,1,3,female,0,0,7.2500,S,Third,woman,False,NaN,Southampton,yes,True
22.0,1,3,female,0,0,7.7750,S,Third,woman,False,NaN,Southampton,yes,True
22.0,0,1,male,0,0,135.6333,C,First,man,True,NaN,Cherbourg,no,True
22.0,0,3,female,0,0,9.8375,S,Third,woman,False,NaN,Southampton,no,True
22.0,0,3,male,0,0,7.2500,S,Third,man,True,NaN,Southampton,no,True
22.0,1,3,male,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,yes,True
22.0,0,3,male,0,0,7.7958,S,Third,man,True,NaN,Southampton,no,True
22.0,0,3,male,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
22.0,1,2,female,1,2,41.5792,C,Second,woman,False,NaN,Cherbourg,yes,False
22.0,1,3,female,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True
22.0,0,3,male,0,0,7.5208,S,Third,man,True,NaN,Southampton,no,True
22.0,1,2,female,1,1,29.0000,S,Second,woman,False,NaN,Southampton,yes,False
22.0,0,3,male,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
22.0,0,3,male,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
22.0,1,1,female,0,2,49.5000,C,First,woman,False,B,Cherbourg,yes,False
22.0,0,3,male,0,0,9.0000,S,Third,man,True,NaN,Southampton,no,True
22.0,1,1,female,0,1,55.0000,S,First,woman,False,E,Southampton,yes,False
22.0,0,3,male,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
22.0,0,3,male,0,0,7.2500,S,Third,man,True,NaN,Southampton,no,True
22.0,1,1,female,1,0,66.6000,S,First,woman,False,C,Southampton,yes,False
22.0,1,1,female,0,0,151.5500,S,First,woman,False,NaN,Southampton,yes,True
22.0,1,3,female,0,0,7.7500,S,Third,woman,False,NaN,Southampton,yes,True
22.0,0,3,male,0,0,9.3500,S,Third,man,True,NaN,Southampton,no,True
22.0,0,3,male,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
22.0,0,3,female,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
22.0,0,3,male,0,0,7.1250,S,Third,man,True,NaN,Southampton,no,True
23.0,0,3,male,0,0,9.2250,S,Third,man,True,NaN,Southampton,no,True
23.0,0,2,male,2,1,11.5000,S,Second,man,True,NaN,Southampton,no,False
23.0,0,2,male,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
23.0,1,1,female,1,0,113.2750,C,First,woman,False,D,Cherbourg,yes,False
23.0,0,2,male,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
23.0,0,3,male,0,0,7.8542,S,Third,man,True,NaN,Southampton,no,True
23.0,0,2,male,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
23.0,1,1,female,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False
23.0,0,2,male,0,0,15.0458,C,Second,man,True,NaN,Cherbourg,no,True
23.0,0,3,female,0,0,7.9250,S,Third,woman,False,NaN,Southampton,no,True
23.0,0,2,male,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
23.0,1,2,female,0,0,13.7917,C,Second,woman,False,D,Cherbourg,yes,True
23.0,0,3,male,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
23.0,1,3,female,0,0,7.5500,S,Third,woman,False,NaN,Southampton,yes,True
23.0,1,1,male,0,1,63.3583,C,First,man,True,D,Cherbourg,yes,False

In [14]:
df.iloc[0:3]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [15]:
df.loc[0:3]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False

In [16]:
df.loc[df["age"]>50,["age","class"]]

      age   class
6    54.0   First
11   58.0   First
15   55.0  Second
33   66.0  Second
54   65.0   First
..    ...     ...
820  52.0   First
829  62.0   First
851  74.0   Third
857  51.0   First
879  56.0   First

[64 rows x 2 columns]

In [17]:
df.loc[(df.age>50) & (df.sex=="male"),["age","sex","class"]].head()

     age   sex   class
6   54.0  male   First
33  66.0  male  Second
54  65.0  male   First
94  59.0  male   Third
96  71.0  male   First

In [18]:
df.loc[(df.age>50) 
       & (df.sex=="male") 
       & (df.embark_town=="Cherbourg") ,
       ["age","sex","embark_town","class"]].head()

      age   sex embark_town  class
54   65.0  male   Cherbourg  First
96   71.0  male   Cherbourg  First
155  51.0  male   Cherbourg  First
174  56.0  male   Cherbourg  First
487  58.0  male   Cherbourg  First

In [18]:
df.loc[(df.age>50)
       & (df.sex=="male")
       & (df.embark_town.str.contains("Cherbourg|Southampton")) ,
       ["age","sex","embark_town","class"]].head()

     age   sex  embark_town   class
6   54.0  male  Southampton   First
33  66.0  male  Southampton  Second
54  65.0  male    Cherbourg   First
94  59.0  male  Southampton   Third
96  71.0  male    Cherbourg   First

In [23]:
df.loc[(df.age>50)
       & (df.sex=="male")
       & (df.embark_town.str.contains("Cherbourg")) ,
       ["age","sex","embark_town","class"]]

      age   sex embark_town  class
54   65.0  male   Cherbourg  First
96   71.0  male   Cherbourg  First
155  51.0  male   Cherbourg  First
174  56.0  male   Cherbourg  First
487  58.0  male   Cherbourg  First
493  71.0  male   Cherbourg  First
587  60.0  male   Cherbourg  First
647  56.0  male   Cherbourg  First
659  58.0  male   Cherbourg  First

In [28]:
df2 = df.dropna()

In [32]:
df2.loc[(df2.embark_town.str.contains("Cherbourg")) ,
       ["age","sex","embark_town","class"]]

      age     sex embark_town  class
1    38.0  female   Cherbourg  First
52   49.0  female   Cherbourg  First
54   65.0    male   Cherbourg  First
96   71.0    male   Cherbourg  First
97   23.0    male   Cherbourg  First
..    ...     ...         ...    ...
742  21.0  female   Cherbourg  First
789  46.0    male   Cherbourg  First
835  39.0  female   Cherbourg  First
879  56.0  female   Cherbourg  First
889  26.0    male   Cherbourg  First

[65 rows x 4 columns]

In [20]:
df.loc[(df.age>50) 
       & (df.sex=="male") 
       & (df.embark_town.isin(["Cherbourg","Southampton"])) ,
       ["age","sex","embark_town","class"]].head()

     age   sex  embark_town   class
6   54.0  male  Southampton   First
33  66.0  male  Southampton  Second
54  65.0  male    Cherbourg   First
94  59.0  male  Southampton   Third
96  71.0  male    Cherbourg   First

In [21]:
df.groupby(["sex","class"]).agg({"survived":["mean","count"]})

               survived
                   mean count
sex    class
female First   0.968085    94
       Second  0.921053    76
       Third   0.500000   144
male   First   0.368852   122
       Second  0.157407   108
       Third   0.135447   347

In [22]:
df.pivot_table(index="sex",values="survived",columns="class",aggfunc=["mean","count"])

            mean                     count
class      First    Second     Third First Second Third
sex
female  0.968085  0.921053  0.500000    94     76   144
male    0.368852  0.157407  0.135447   122    108   347

In [23]:
df.pivot_table(index="sex",values="survived",columns=["embarked","class"],aggfunc=["mean","count"])

              mean                                                    \
embarked         C                      Q                          S
class        First Second     Third First Second     Third     First
sex
female    0.976744    1.0  0.652174   1.0    1.0  0.727273  0.958333
male      0.404762    0.2  0.232558   0.0    0.0  0.076923  0.354430

                             count                                        \
embarked                         C                  Q                  S
class       Second     Third First Second Third First Second Third First
sex
female    0.910448  0.375000    43      7    23     1      2    33    48
male      0.154639  0.128302    42     10    43     1      1    39    79


embarked
class    Second Third
sex
female       67    88
male         97   265

In [24]:
df.pivot_table(index="embarked",values="survived",aggfunc=["mean","count"])

              mean    count
          survived survived
embarked
C         0.553571      168
Q         0.389610       77
S         0.336957      644

In [25]:
import numpy as np
bins = [0,10,18,28,40,np.inf]
df["new_age"]=pd.cut(x=df["age"],bins=bins,include_lowest=True)

In [26]:
df.groupby("new_age").agg({"survived":["mean","count"]})

                survived
                    mean count
new_age
(-0.001, 10.0]  0.593750    64
(10.0, 18.0]    0.426667    75
(18.0, 28.0]    0.349776   223
(28.0, 40.0]    0.430693   202
(40.0, inf]     0.366667   150

In [53]:
df.groupby(["sex","new_age"]).agg({"survived":["mean","count"]})

                       survived
                           mean count
sex    new_age
female (-0.001, 10.0]  0.612903    31
       (10.0, 18.0]    0.729730    37
       (18.0, 28.0]    0.750000    72
       (28.0, 40.0]    0.821918    73
       (40.0, inf]     0.770833    48
male   (-0.001, 10.0]  0.575758    33
       (10.0, 18.0]    0.131579    38
       (18.0, 28.0]    0.158940   151
       (28.0, 40.0]    0.209302   129
       (40.0, inf]     0.176471   102

In [62]:
df.groupby(['sex', 'new_age'])['survived'].transform("mean")

0      0.158940
1      0.821918
2      0.750000
3      0.821918
4      0.209302
         ...
886    0.158940
887    0.750000
888         NaN
889    0.158940
890    0.209302
Name: survived, Length: 891, dtype: float64

In [65]:
df.groupby("class")['survived'].mean()

class
First     0.629630
Second    0.472826
Third     0.242363
Name: survived, dtype: float64

In [68]:
df["class_mean"] =df.groupby("class")["survived"].transform("mean")
df[["class","class_mean"]]

      class  class_mean
0     Third    0.242363
1     First    0.629630
2     Third    0.242363
3     First    0.629630
4     Third    0.242363
..      ...         ...
886  Second    0.472826
887   First    0.629630
888   Third    0.242363
889   First    0.629630
890   Third    0.242363

[891 rows x 2 columns]

In [70]:
df.groupby(["sex","class"])["age"].transform("mean")

0      26.507589
1      34.611765
2      21.750000
3      34.611765
4      26.507589
         ...
886    30.740707
887    34.611765
888    21.750000
889    41.281386
890    26.507589
Name: age, Length: 891, dtype: float64

In [ ]:
df.groupby(["sex","class"])["age"].transform("mean")

In [72]:
df.groupby(["sex","class"])["survived"].mean()

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

In [73]:
df["sex_class_mean"]= df.groupby(["sex","class"])["survived"].transform("mean")
df[["sex","class","sex_class_mean"]]

        sex   class  sex_class_mean
0      male   Third        0.135447
1    female   First        0.968085
2    female   Third        0.500000
3    female   First        0.968085
4      male   Third        0.135447
..      ...     ...             ...
886    male  Second        0.157407
887  female   First        0.968085
888  female   Third        0.500000
889    male   First        0.368852
890    male   Third        0.135447

[891 rows x 3 columns]

In [28]:
df["new"]= df.groupby(['sex', 'new_age'])['survived'].transform('mean')

In [29]:
df[["sex","new_age","new"]].head(15)

       sex         new_age       new
0     male    (18.0, 28.0]  0.158940
1   female    (28.0, 40.0]  0.821918
2   female    (18.0, 28.0]  0.750000
3   female    (28.0, 40.0]  0.821918
4     male    (28.0, 40.0]  0.209302
5     male             NaN       NaN
6     male     (40.0, inf]  0.176471
7     male  (-0.001, 10.0]  0.575758
8   female    (18.0, 28.0]  0.750000
9   female    (10.0, 18.0]  0.729730
10  female  (-0.001, 10.0]  0.612903
11  female     (40.0, inf]  0.770833
12    male    (18.0, 28.0]  0.158940
13    male    (28.0, 40.0]  0.209302
14  female    (10.0, 18.0]  0.729730

In [30]:
df.pivot_table(index="sex",values="survived",columns=["new_age","class"])

new_age (-0.001, 10.0]                  (10.0, 18.0]                   \
class            First Second     Third        First Second     Third
sex
female             0.0    1.0  0.500000     1.000000    1.0  0.523810
male               1.0    1.0  0.363636     0.666667    0.0  0.103448

new_age (18.0, 28.0]                     (28.0, 40.0]                      \
class          First    Second     Third        First    Second     Third
sex
female      0.944444  0.875000  0.533333     1.000000  0.956522  0.400000
male        0.500000  0.034483  0.134615     0.464286  0.088235  0.164179

new_age (40.0, inf]
class         First    Second     Third
sex
female     0.961538  0.846154  0.111111
male       0.280000  0.095238  0.064516

In [11]:
df["age2"] = df["age"]**2
df["age3"] = df["age"]*3

In [16]:
df.loc[:,df.columns.str.contains("age")]

      age    age2   age3
0    22.0   484.0   66.0
1    38.0  1444.0  114.0
2    26.0   676.0   78.0
3    35.0  1225.0  105.0
4    35.0  1225.0  105.0
..    ...     ...    ...
886  27.0   729.0   81.0
887  19.0   361.0   57.0
888   NaN     NaN    NaN
889  26.0   676.0   78.0
890  32.0  1024.0   96.0

[891 rows x 3 columns]

In [33]:
df.loc[:,df.columns.isin(["age","age2","age3"])].apply(lambda x:x/10)

     age   age2  age3
0    2.2   48.4   6.6
1    3.8  144.4  11.4
2    2.6   67.6   7.8
3    3.5  122.5  10.5
4    3.5  122.5  10.5
..   ...    ...   ...
886  2.7   72.9   8.1
887  1.9   36.1   5.7
888  NaN    NaN   NaN
889  2.6   67.6   7.8
890  3.2  102.4   9.6

[891 rows x 3 columns]

In [34]:
df.loc[:,df.columns.isin(["age","age2","age3"])].apply(lambda x:(x-x.mean())/x.std())

          age      age2      age3
0   -0.530005 -0.614241 -0.530005
1    0.571430  0.354400  0.571430
2   -0.254646 -0.420512 -0.254646
3    0.364911  0.133429  0.364911
4    0.364911  0.133429  0.364911
..        ...       ...       ...
886 -0.185807 -0.367035 -0.185807
887 -0.736524 -0.738348 -0.736524
888       NaN       NaN       NaN
889 -0.254646 -0.420512 -0.254646
890  0.158392 -0.069380  0.158392

[891 rows x 3 columns]

In [35]:
a = pd.Series([1,2,3,4,5,6,7]);a

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [36]:
type(a)

pandas.core.series.Series

In [37]:
a - a.mean()

0   -3.0
1   -2.0
2   -1.0
3    0.0
4    1.0
5    2.0
6    3.0
dtype: float64

In [38]:
df.loc[:,df.columns.isin(["age","age2","age3"])].agg(lambda x:(x-x.mean())/x.std())

          age      age2      age3
0   -0.530005 -0.614241 -0.530005
1    0.571430  0.354400  0.571430
2   -0.254646 -0.420512 -0.254646
3    0.364911  0.133429  0.364911
4    0.364911  0.133429  0.364911
..        ...       ...       ...
886 -0.185807 -0.367035 -0.185807
887 -0.736524 -0.738348 -0.736524
888       NaN       NaN       NaN
889 -0.254646 -0.420512 -0.254646
890  0.158392 -0.069380  0.158392

[891 rows x 3 columns]

In [39]:
def scaler(x):
    return (x-x.mean()) / x.std()
 
df.loc[:,df.columns.isin(["age","age2","age3"])].apply(scaler)

          age      age2      age3
0   -0.530005 -0.614241 -0.530005
1    0.571430  0.354400  0.571430
2   -0.254646 -0.420512 -0.254646
3    0.364911  0.133429  0.364911
4    0.364911  0.133429  0.364911
..        ...       ...       ...
886 -0.185807 -0.367035 -0.185807
887 -0.736524 -0.738348 -0.736524
888       NaN       NaN       NaN
889 -0.254646 -0.420512 -0.254646
890  0.158392 -0.069380  0.158392

[891 rows x 3 columns]

In [40]:
m = np.random.randint(1,30,size=(5,3))
df1 = pd.DataFrame(m,columns=["var1","var2","var3"])
df2 = df1 + 99
df1

   var1  var2  var3
0     8     6    26
1    29    23    10
2    17    24     4
3     1    13    14
4    15    14    19

In [41]:
df2

   var1  var2  var3
0   107   105   125
1   128   122   109
2   116   123   103
3   100   112   113
4   114   113   118

In [42]:
pd.concat([df1,df2],axis=1)

   var1  var2  var3  var1  var2  var3
0     8     6    26   107   105   125
1    29    23    10   128   122   109
2    17    24     4   116   123   103
3     1    13    14   100   112   113
4    15    14    19   114   113   118

In [43]:
pd.concat([df1,df2],axis=0,ignore_index=True)

   var1  var2  var3
0     8     6    26
1    29    23    10
2    17    24     4
3     1    13    14
4    15    14    19
5   107   105   125
6   128   122   109
7   116   123   103
8   100   112   113
9   114   113   118

In [4]:
df1 = pd.DataFrame({"employees":["jon","dennis","mark","maria"],
                    "group":["accountant","engineering","engineering","hr"]})
df2 = pd.DataFrame({"employees":["dennis","jon","mark","maria","kemal"],
                    "start_date":[2010,2009,2014,2019,2020]})

df1

  employees        group
0       jon   accountant
1    dennis  engineering
2      mark  engineering
3     maria           hr

In [5]:
df2

  employees  start_date
0    dennis        2010
1       jon        2009
2      mark        2014
3     maria        2019
4     kemal        2020

In [6]:
pd.merge(df1,df2,on="employees")

  employees        group  start_date
0       jon   accountant        2009
1    dennis  engineering        2010
2      mark  engineering        2014
3     maria           hr        2019

In [47]:
pd.merge(df1,df2,on="employees",how="outer")

  employees        group  start_date
0       jon   accountant        2009
1    dennis  engineering        2010
2      mark  engineering        2014
3     maria           hr        2019
4     kemal          NaN        2020

In [48]:
df3=pd.merge(df1,df2)

In [49]:
df4 = pd.DataFrame({"group":["accountant","engineering","hr"],
                    "manager":["oskar","koray","çağatay"]})
df4

         group  manager
0   accountant    oskar
1  engineering    koray
2           hr  çağatay

In [50]:
pd.merge(df3,df4)

  employees        group  start_date  manager
0       jon   accountant        2009    oskar
1    dennis  engineering        2010    koray
2      mark  engineering        2014    koray
3     maria           hr        2019  çağatay

In [51]:
series = pd.Series([1,2,3])
series**2

0    1
1    4
2    9
dtype: int64

In [52]:
df.index.values

array([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,
        13,  14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,
        26,  27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,
        39,  40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,
        52,  53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,
        65,  66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,
        78,  79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,
        91,  92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103,
       104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116,
       117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129,
       130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142,
       143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155,
       156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168,
       169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181,
       182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194,
       195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207,
       208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220,
       221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233,
       234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246,
       247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259,
       260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272,
       273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285,
       286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298,
       299, 300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311,
       312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324,
       325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337,
       338, 339, 340, 341, 342, 343, 344, 345, 346, 347, 348, 349, 350,
       351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363,
       364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376,
       377, 378, 379, 380, 381, 382, 383, 384, 385, 386, 387, 388, 389,
       390, 391, 392, 393, 394, 395, 396, 397, 398, 399, 400, 401, 402,
       403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415,
       416, 417, 418, 419, 420, 421, 422, 423, 424, 425, 426, 427, 428,
       429, 430, 431, 432, 433, 434, 435, 436, 437, 438, 439, 440, 441,
       442, 443, 444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454,
       455, 456, 457, 458, 459, 460, 461, 462, 463, 464, 465, 466, 467,
       468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480,
       481, 482, 483, 484, 485, 486, 487, 488, 489, 490, 491, 492, 493,
       494, 495, 496, 497, 498, 499, 500, 501, 502, 503, 504, 505, 506,
       507, 508, 509, 510, 511, 512, 513, 514, 515, 516, 517, 518, 519,
       520, 521, 522, 523, 524, 525, 526, 527, 528, 529, 530, 531, 532,
       533, 534, 535, 536, 537, 538, 539, 540, 541, 542, 543, 544, 545,
       546, 547, 548, 549, 550, 551, 552, 553, 554, 555, 556, 557, 558,
       559, 560, 561, 562, 563, 564, 565, 566, 567, 568, 569, 570, 571,
       572, 573, 574, 575, 576, 577, 578, 579, 580, 581, 582, 583, 584,
       585, 586, 587, 588, 589, 590, 591, 592, 593, 594, 595, 596, 597,
       598, 599, 600, 601, 602, 603, 604, 605, 606, 607, 608, 609, 610,
       611, 612, 613, 614, 615, 616, 617, 618, 619, 620, 621, 622, 623,
       624, 625, 626, 627, 628, 629, 630, 631, 632, 633, 634, 635, 636,
       637, 638, 639, 640, 641, 642, 643, 644, 645, 646, 647, 648, 649,
       650, 651, 652, 653, 654, 655, 656, 657, 658, 659, 660, 661, 662,
       663, 664, 665, 666, 667, 668, 669, 670, 671, 672, 673, 674, 675,
       676, 677, 678, 679, 680, 681, 682, 683, 684, 685, 686, 687, 688,
       689, 690, 691, 692, 693, 694, 695, 696, 697, 698, 699, 700, 701,
       702, 703, 704, 705, 706, 707, 708, 709, 710, 711, 712, 713, 714,
       715, 716, 717, 718, 719, 720, 721, 722, 723, 724, 725, 726, 727,
       728, 729, 730, 731, 732, 733, 734, 735, 736, 737, 738, 739, 740,
       741, 742, 743, 744, 745, 746, 747, 748, 749, 750, 751, 752, 753,
       754, 755, 756, 757, 758, 759, 760, 761, 762, 763, 764, 765, 766,
       767, 768, 769, 770, 771, 772, 773, 774, 775, 776, 777, 778, 779,
       780, 781, 782, 783, 784, 785, 786, 787, 788, 789, 790, 791, 792,
       793, 794, 795, 796, 797, 798, 799, 800, 801, 802, 803, 804, 805,
       806, 807, 808, 809, 810, 811, 812, 813, 814, 815, 816, 817, 818,
       819, 820, 821, 822, 823, 824, 825, 826, 827, 828, 829, 830, 831,
       832, 833, 834, 835, 836, 837, 838, 839, 840, 841, 842, 843, 844,
       845, 846, 847, 848, 849, 850, 851, 852, 853, 854, 855, 856, 857,
       858, 859, 860, 861, 862, 863, 864, 865, 866, 867, 868, 869, 870,
       871, 872, 873, 874, 875, 876, 877, 878, 879, 880, 881, 882, 883,
       884, 885, 886, 887, 888, 889, 890], dtype=int64)